Управление_по_целям_и_KPI/src/Catalogs/KPI_ПоказателиРасчета/KPI_ПоказателиРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_ПоказателиРасчета</name>
  <predefined>
    <items>
      <name>БазовыеНачисления</name>
      <description>Базовые начисления</description>
    </items>
    <items>
      <name>ИтоговыйКПР</name>
      <description>Итоговый КПР</description>
    </items>
  </predefined>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ЗначенияПоказателей/KPI_ЗначенияПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_ЗначенияПоказателей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.KPI_ПоказателиРасчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Catalogs/KPI_ПоказателиРасчета/ManagerModule.bsl
//Функция возвращает значение показателя расчета
//
//Параметры:
// Сотрудник            - тип СправочникСсылка.KPI_Сотрудники, сотрудник по котрому происходит расчет
// ПоказательНачисления - тип СправочникСсылка.KPI_ПоказателиНачислений, рассчитываемый показатель
// ПланыФакты           - тип ТаблицаЗначений, планы/факты
// АдресПланФакты       - тип Строка, адрес таблицы план/факты во временном хранилище 
//
//Возвращаемое значение:
//  Плановые начисления объектов управления - тип таблица значений
//
Функция ПолучитьЗначениеПоказателяНачисления(Сотрудник, ПоказательНачисления, ПланыФакты, АдресПланФакты) Экспорт	
	
	ЗначениеПоказателя = 0;
	КритерийПоискаСотрудник     = Новый Структура("СтруктураКомпании, ЦелевойПоказатель", Сотрудник.СтруктураКомпании);
	
	Если ПоказательНачисления = Справочники.KPI_ПоказателиРасчета.ИтоговыйКПР Тогда
		
		КритерийПоиска = Новый Структура("СтруктураКомпании", Сотрудник.СтруктураКомпании);
		Для Каждого Стр Из ПланыФакты.НайтиСтроки(КритерийПоиска) Цикл
			ЗначениеПоказателя = ЗначениеПоказателя + Стр.КПР;
		КонецЦикла; 
		
		Возврат ЗначениеПоказателя;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(KPI_ЗначенияПоказателей.Значение, 0) КАК Значение
	|ИЗ
	|	РегистрСведений.KPI_ЗначенияПоказателей КАК KPI_ЗначенияПоказателей
	|ГДЕ
	|	KPI_ЗначенияПоказателей.Показатель = &Показатель
	|	И KPI_ЗначенияПоказателей.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Показатель", ПоказательНачисления);
	Запрос.УстановитьПараметр("Сотрудник",  Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеПоказателя = Выборка.Значение;
	КонецЕсли;
	
	Возврат ЗначениеПоказателя;	
	
КонецФункции
